diega/timemachine-firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c3"

# Flash size configuration
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# LWIP Configuration for NTP
CONFIG_LWIP_SNTP_UPDATE_DELAY=3600000

# Enable SNTP
CONFIG_LWIP_DHCP_GET_NTP_SRV=y
